menu_data = {
    "كريبات الفراخ": [
        {"id": 1, "name": "شاورما دجاج", "price": 130, "desc": "شاورما دجاج مميزة"},
        {"id": 2, "name": "شيش طاووق", "price": 130, "desc": "شيش طاووق طازج"},
        {"id": 3, "name": "استربس", "price": 130, "desc": "قطع استربس مقرمشة"},
        {"id": 4, "name": "زنجر", "price": 130, "desc": "زنجر حار لمحبي السبايسي"},
    ],
    "سندوتشات": [
        {"id": 5, "name": "بانية", "price": 70, "desc": "صدور دجاج مقلية مقرمشة"},
        {"id": 6, "name": "كوردن بلو", "price": 100, "desc": "صدور دجاج محشوة"},
        {"id": 7, "name": "برجر جبنة", "price": 95, "desc": "لحم بقري مع جبنة سايحة"},
    ],
    "ميكسات": [
        {"id": 8, "name": "سوبر كرانشي", "price": 130, "desc": "ميكس دجاج مدخن"},
        {"id": 9, "name": "ميكس الشيف", "price": 140, "desc": "تشكيلة من صوصاتنا الخاصة"},
    ]
}